<html>
<head>
    <title>Условия, функции</title>
    <style>
        ul{
            list-style: none;
            text-align: center;
            background: #a3a3a3;
        }
        li{
            float:left;
            padding: 5px;
            outline: 1px solid #42b983;
        }
        a{
            display: block;
            width: 150px;
            height: 25px;
            text-decoration: none;
            color: #2c3e50;
            cursor: pointer;
            background: #e3e3e3;
        }
    </style>
</head>
<body>

<header>
    <?
    menu();
    ?>
    /*меню здесь*/

</header>
<h1></h1>
<h2></h2>
<p>
    <?php
    /*задание 1*/
    $n = 0;
    while($n <= 100)
    {
        echo $n == 0? $n. '- ноль '.'<br>' : (($n % 3) ? $n.'- не делится'.'<br>' : $n. '- делится'.'<br>' );
        $n++;
    }
    /*задание 2*/
    function numbers($c) {
        do{
            echo $c == 0? $c.'- ноль'. '<br>' : (($c % 2)? $c.'- нечетное'.'<br>' : $c. ' - четное'.'<br>');
            $c++;
        }
        while($c <= 10);
    }
    numbers(0);
    /*задание 3*/
    $arr = [
        'Московская область' => ['Абрамовка','Абрамцево','Авдеево','Авдотьино','Авсюнино','Акатьево','Алабино','Алабушево',
            'Александрово','Алексино','Алексино-Шатур','Алпатьево','Алферьево','Андреевка','Астапово','Атепцево','Афанасовка',
            'Ашитково','Ашукино','Бабенки','Бакшеево','Барабаново','Барановское','Барвиха','Барвиха'],
        'Алтайский край' => ['Акимовка','Акутиха','Алейск','Алейский','Александровский','Алексеевка','Аллак','Алтай','Алтайское','Ананьевка','Андроново','Анисимово','Антипино','Антоньевка','Ануйское','Асямовка'],
        'Амурская область' => ['Арга','Аркадьевка','Арсентьевка','Архара','БАМ','Безозерное','Беленький','Белогорск','Белогорье','Белоногово','Белоярово','Белый Яр','Береговой','Березовка'],
        'Архангельская область' => ['Азополье','Аксеновская','Алешковская','Алферовская','Анашкино','Андреевская','Андриановская','Анцифировский Бор','Аргуновский','Артемьевская','Артюшинская','Архангельск','Белогорский','Белое Озеро','Беломорье','Белощелье','Березник','Березник','Березовка','Березонаволок'],
        'Астраханская область' => ['Аксарайская','Алексеевка','Алтынжар','Алча','Ассадулаево','Астрахань','Ахтубинск','Байбек','Барановка','Басы','Батаевка','Бахтемир','Белячье','Бирюковка','Бирючья Коса'],
        'Белгородская область' => ['Александровка','Алексеевка','Андреевка','Анновка','Арнаутово','Архангельское','Афанасово','Афанасьевка','Байцуры','Барсучье','Батрацкая Дача','Безымено','Белгород','Беленихино','Беленькое','Беловское']
    ];
    foreach ($arr as $key => $value){
        echo '<br>'.$key. ':';
        foreach ($value as $item )
            echo $item.', ';
    }
    /*задание 4*/
    function trans($str){

        $alf = [' ' => ' ','А'=>'A', 'Б'=>'B', 'В'=>'V', 'Г'=>'G', 'Д'=>'D', 'Е'=>'E', 'Ж'=>'J', 'З'=>'Z', 'И'=>'Y', 'К'=>'K', 'Л'=>'L', 'М'=>'M', 'Н'=>'N', 'О'=>'O', 'П'=>'P', 'Р'=>'R', 'С'=>'S', 'Т'=>'T', 'У'=>'U', 'Ф'=>'F', 'Х'=>'H', 'Ц'=>'C', 'Ч'=>'CH', 'Ш'=>'SH', 'Щ'=>'SCH', 'Ъ'=>'', 'Ь'=>'', 'Ы'=>'I', 'Ю'=>'JU', 'Я'=>'YA',
            'а' => 'a','б' =>'b','в' =>'v', 'г' => 'g',
            'д' => 'd',
            'е'=>'e', 'ж'=>'j', 'з'=>'z', 'и'=>'y', 'к'=>'k', 'л' =>'l','м'=>'m', 'н'=>'n', 'о'=>'o', 'п'=>'p', 'р'=>'r', 'с' =>'s','т'=>'t', 'у'=>'u', 'ф'=>'f', 'х'=>'h', 'ц'=>'c', 'ч'=>'ch', 'ш'=>'sh', 'щ'=>'sch', 'ь'=>'', 'ъ'=>'', 'ы' =>'i','ю' =>'ju','я'=>'ya',
        ];
        $arr1 = strtr($str,$alf);

        echo  '<br>'.$arr1. '<br>';
    }
    $stroka = "Гульназ";
    trans($stroka);
    /* задание 5 */
    function replas_($str3){

        $newstr2 = str_replace(' ', '_', $str3);
        echo '<br>'.$newstr2. '<br>';
    }

    $pred = 'Сегодня прекрассная погода для прогулки.';
    replas_($pred);

    /* задание 6 */
    function menu(){
        $arr_li=[
            'Главная','О нас','Услуги','Новости','Контакты'
        ];
        echo '<ul>';
        foreach($arr_li as $value){
            echo '<li>'.'<a href="#">'.$value.'</a>'.'</li>';
        }
        echo '</ul><br>';
    }
    /* задание 7 */
    function prin($l){
        echo $l;
    }
    for($l=0; $l <= 9; prin($l++)){}

    /*задание 8*/
    $arr = [
        'Московская область' => ['Абрамовка','Абрамцево','Авдеево','Авдотьино','Авсюнино','Акатьево','Алабино','Алабушево',
            'Александрово','Алексино','Алексино-Шатур','Алпатьево','Алферьево','Андреевка','Астапово','Атепцево','Афанасовка',
            'Ашитково','Ашукино','Бабенки','Бакшеево','Барабаново','Барановское','Барвиха','Барвиха'],
        'Алтайский край' => ['Акимовка','Акутиха','Алейск','Алейский','Александровский','Алексеевка','Аллак','Алтай','Алтайское','Ананьевка','Андроново','Анисимово','Антипино','Антоньевка','Ануйское','Асямовка'],
        'Амурская область' => ['Арга','Аркадьевка','Арсентьевка','Архара','БАМ','Безозерное','Беленький','Белогорск','Белогорье','Белоногово','Белоярово','Белый Яр','Береговой','Березовка'],
        'Архангельская область' => ['Азополье','Аксеновская','Алешковская','Алферовская','Анашкино','Андреевская','Андриановская','Анцифировский Бор','Аргуновский','Артемьевская','Артюшинская','Архангельск','Белогорский','Белое Озеро','Беломорье','Белощелье','Березник','Березник','Березовка','Березонаволок'],
        'Астраханская область' => ['Аксарайская','Алексеевка','Алтынжар','Алча','Ассадулаево','Астрахань','Ахтубинск','Байбек','Барановка','Басы','Батаевка','Бахтемир','Белячье','Бирюковка','Бирючья Коса'],
        'Белгородская область' => ['Александровка','Алексеевка','Андреевка','Анновка','Арнаутово','Архангельское','Афанасово','Афанасьевка','Байцуры','Барсучье','Батрацкая Дача','Безымено','Белгород','Беленихино','Беленькое','Беловское']
    ];
    foreach ($arr as $key => $value){
        echo '<br>'.$key. ':';
        foreach($value as $item ){
            $po = stripos($item, 'А');
            if(($po !== false)){
                echo $item.', ';
            }
        }
    }
    ?>
</p>
<footer><?= date("Y-m-d").' '.date("H:i:s").' '.date("e");?>
</footer>
</body>
</html>
